app/controllers/microposts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 3]]
---
  def index
    if (params[:user_id])
      @user = User.find(params[:user_id])
      @microposts = @user.microposts
    else
      @microposts = Micropost.all

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "hello"], ["created_at", Tue, 14 Jan 2014 16:14:38 UTC +00:00], ["updated_at", Tue, 14 Jan 2014 16:14:38 UTC +00:00], ["user_id", 1]]
---
  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if ((User.exists?(@micropost.user_id)) && (@micropost.save))

UPDATE "microposts" SET "content" = ?, "updated_at" = ? WHERE "microposts"."id" = 7  [["content", "dereretre"], ["updated_at", Wed, 02 Apr 2014 03:49:13 UTC +00:00]]
---
  def update
    respond_to do |format|
      if ((User.exists?(params[:micropost][:user_id])) && (@micropost.update(micropost_params)))

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT 1  [["id", "6"]]
---
    def set_micropost
      @micropost = Micropost.find(params[:id])